# config.py

# ID администратора в Telegram
# ID разработчика (сюда впишите ВАШ ID для получения уведомлений)
DEVELOPER_TELEGRAM_ID = 947773509

# ID администратора (сюда впишите ID человека, который будет управлять групповым ДЗ)
ADMIN_IDS = [947773509, 1478663621, 250307604, 931729686]  # Замените на ID администратора
# Токен вашего бота
BOT_TOKEN = "8411680089:AAEqJ9KeoKC-_cdIQ_H4B9Lp6IgYS7Bm4co"  # Замените на ваш токен

# Цветовая схема для Google Календаря
COLOR_MAP = {"Лекция": "9", "Семинар": "11", "Лабораторные работы": "10"}

# Теги для описания и заголовка домашнего задания
PERSONAL_HOMEWORK_DESC_TAG = "--- Мое дз ---"
GROUP_HOMEWORK_DESC_TAG = "--- Общее дз ---"
HOMEWORK_TITLE_TAG = "\n!!!ДЗ!!!"

# Данные расписания
SCHEDULE_DATA = {
    "Понедельник": {
        "Нечетная неделя": [
            {"time": "15:55 – 19:05", "subject": "УТП", "teacher": "не указан", "room": "МТ13",
             "type": "Семинар"},

        ],
        "Четная неделя": [
            {"time": "15:55 – 19:05", "subject": "УТП", "teacher": "не указан", "room": "МТ13",
             "type": "Семинар"},

        ]
    },
    "Вторник": {
        "Нечетная неделя": [
            {"time": "10:10 – 11:40", "subject": "Линейная алгебра и аналитическая геометрия",
             "teacher": "Ветохин А. Н.", "room": "216л", "type": "Лекция"},
            {"time": "11:50 – 13:20", "subject": "Математический анализ", "teacher": "Сунчалин А. М.", "room": "216л",
             "type": "Лекция"},
            {"time": "14:05 – 15:35", "subject": "Иностранный язык", "teacher": "не указан", "room": "каф. Л2",
             "type": "Семинар"},
            {"time": "15:55 – 17:25", "subject": "Математический анализ", "teacher": "Сунчалин А. М.", "room": "913л",
             "type": "Семинар"}
        ],
        "Четная неделя": [
            {"time": "10:10 – 11:40", "subject": "История России", "teacher": "Крылов А. О.", "room": "216л",
             "type": "Лекция"},
            {"time": "11:50 – 13:20", "subject": "Математический анализ", "teacher": "Сунчалин А. М.", "room": "216л",
             "type": "Лекция"},
            {"time": "14:05 – 15:35", "subject": "Иностранный язык", "teacher": "не указан", "room": "каф. Л2",
             "type": "Семинар"},
            {"time": "15:55 – 17:25", "subject": "Математический анализ", "teacher": "Сунчалин А. М.", "room": "913л",
             "type": "Семинар"}
        ]
    },
    "Среда": {
        "Нечетная неделя": [
            {"time": "08:30 – 10:00", "subject": "Экономика фирмы", "teacher": "Шкодинский С. В.", "room": "515ю",
             "type": "Лекция"},
            {"time": "10:10 – 11:40", "subject": "Макроэкономика", "teacher": "Ядова Н. Е.", "room": "515ю",
             "type": "Лекция"},
            {"time": "12:25 – 13:55", "subject": "Теоретические основы информатики", "teacher": "Горячкин Б. С.",
             "room": "621к", "type": "Семинар"},
            {"time": "14:05 – 15:35", "subject": "Теоретические основы информатики", "teacher": "Ивченко Д. Д.",
             "room": "402к", "type": "Лабораторные работы"}
        ],
        "Четная неделя": [
            {"time": "10:10 – 11:40", "subject": "Теоретические основы информатики", "teacher": "Горячкин Б. С.",
             "room": "301х", "type": "Лекция"},
            {"time": "12:25 – 13:55", "subject": "Макроэкономика", "teacher": "Ядова Н. Е.", "room": "617к",
             "type": "Семинар"},
            {"time": "14:05 – 15:35", "subject": "Теоретические основы информатики", "teacher": "Ивченко Д. Д.",
             "room": "402к", "type": "Лабораторные работы"}
        ]
    },
    "Четверг": {
        "Нечетная неделя": [
            {"time": "08:30 – 10:00", "subject": "Экономика фирмы", "teacher": "не указан", "room": "213х",
             "type": "Семинар"},
            {"time": "10:10 – 11:40", "subject": "Введение в профессию", "teacher": "Вашлаев А. Д.", "room": "201х",
             "type": "Лекция"},
            {"time": "11:50 – 13:20", "subject": "Основы бизнес-информатики", "teacher": "Куликова М. Е.",
             "room": "617к", "type": "Семинар"},
            {"time": "14:30 – 16:00", "subject": "Физическая культура и спорт", "teacher": "не указан",
             "room": "каф. ФВ", "type": "Семинар"}
        ],
        "Четная неделя": [
            {"time": "10:10 – 11:40", "subject": "Основы бизнес-информатики", "teacher": "Горбачёв А. С.",
             "room": "201х", "type": "Лекция"},
            {"time": "11:50 – 13:20", "subject": "Основы бизнес-информатики", "teacher": "Куликова М. Е.",
             "room": "617к", "type": "Семинар"},
            {"time": "14:30 – 16:00", "subject": "Физическая культура и спорт", "teacher": "не указан",
             "room": "каф. ФВ", "type": "Семинар"}
        ]
    },
    "Пятница": {
        "Нечетная неделя": [
            {"time": "08:30 – 10:00", "subject": "История России", "teacher": "Коломиец А. В.", "room": "717л",
             "type": "Семинар"},
            {"time": "10:10 – 11:40", "subject": "Линейная алгебра и аналитическая геометрия",
             "teacher": "Пономарев А. Н.", "room": "913л", "type": "Семинар"},
            {"time": "12:15 – 13:45", "subject": "Физическая культура и спорт", "teacher": "не указан",
             "room": "каф. ФВ", "type": "Семинар"}
        ],
        "Четная неделя": [
            {"time": "08:30 – 10:00", "subject": "История России", "teacher": "Коломиец А. В.", "room": "717л",
             "type": "Семинар"},
            {"time": "10:10 – 11:40", "subject": "Линейная алгебра и аналитическая геометрия",
             "teacher": "Пономарев А. Н.", "room": "913л", "type": "Семинар"},
            {"time": "12:15 – 13:45", "subject": "Физическая культура и спорт", "teacher": "не указан",
             "room": "каф. ФВ", "type": "Семинар"}
        ]
    }
}

# --- Настройки для веб-сервера авторизации ---
# Адрес, который слушает Flask-сервер
OAUTH_SERVER_HOST = "127.0.0.1"
# Порт для Flask-сервера
OAUTH_SERVER_PORT = 8080

# URI, на который Google перенаправляет пользователя ПОСЛЕ авторизации
# ВАЖНО: Этот URI должен быть добавлен в Google Cloud Console!
REDIRECT_URI = f"http://{OAUTH_SERVER_HOST}:{OAUTH_SERVER_PORT}/oauth2callback"

# --- Настройки для внутреннего веб-сервера бота ---
# Адрес, который слушает внутренний сервер для коллбэков
INTERNAL_SERVER_HOST = "127.0.0.1"
# Порт для внутреннего сервера
INTERNAL_SERVER_PORT = 8081

# URL, по которому Flask-сервер уведомляет основного бота об успехе
BOT_CALLBACK_URL = f"http://{INTERNAL_SERVER_HOST}:{INTERNAL_SERVER_PORT}/auth_success"